app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
  def index
    @pokemons = Pokemon.all

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."name" = ? LIMIT ?  [["name", "rapidash"], ["LIMIT", 1]]
INSERT INTO "pokemons" ("number", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", 1], ["name", "bulbasaur"], ["created_at", "2020-10-09 08:09:50.207660"], ["updated_at", "2020-10-09 08:09:50.207660"]]
---
  def new
    @haspoke = Pokemon.all
    if @haspoke.find_by(name:params[:name])
      puts "ja está cadastrado"
    else
      @pokemon = Pokemon.new
      @pokemon.number = PokeApi.get(pokemon:params[:name]).id
      @pokemon.name = params[:name]
      @pokemon.save

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @pokemons =Pokemon.all
    if @pokemons.find_by(name:params[:name])
       @pokemons.find_by(id:params[:name]).destroy

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 78], ["LIMIT", 1]]
---
    def set_pokemon
      @pokemon = Pokemon.find(params[:id])